torbrodtkorb/alva-master/firmware/pack/edc/AVR64DA64.PIC
        <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x84C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
              <edc:SFRFieldDef edc:cname="IREI" edc:nzwidth="0x1" edc:desc="IrDA Event Input Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="TXPLCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x84D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
              <edc:SFRFieldDef edc:cname="TXPL" edc:nzwidth="0x8" edc:desc="Transmit pulse length"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="RXPLCTRL" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x84E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
              <edc:SFRFieldDef edc:cname="RXPL" edc:nzwidth="0x7" edc:desc="Receiver Pulse Lenght"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x11" edc:_addr="0x84F"/>
        <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="RXDATAL" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x860">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x8" edc:desc="RX Data"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="RXDATAH" edc:nzwidth="0x8" edc:access="rr---rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC7" edc:_addr="0x861">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="DATA8" edc:nzwidth="0x1" edc:desc="Receiver Data Register"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Parity Error"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Frame Error"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="BUFOVF" edc:nzwidth="0x1" edc:desc="Buffer Overflow"/>
              <edc:SFRFieldDef edc:cname="RXCIF" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="TXDATAL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x862">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x8" edc:desc="Transmit Data Register"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="TXDATAH" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x863">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="DATA8" edc:nzwidth="0x1" edc:desc="Transmit Data Register (CHSIZE=9bit)"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="nnnnn-nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xFB" edc:_addr="0x864">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="WFB" edc:nzwidth="0x1" edc:desc="Wait For Break"/>
              <edc:SFRFieldDef edc:cname="BDF" edc:nzwidth="0x1" edc:desc="Break Detected Flag"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ISFIF" edc:nzwidth="0x1" edc:desc="Inconsistent Sync Field Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="RXSIF" edc:nzwidth="0x1" edc:desc="Receive Start Interrupt"/>
              <edc:SFRFieldDef edc:cname="DREIF" edc:nzwidth="0x1" edc:desc="Data Register Empty Flag"/>
              <edc:SFRFieldDef edc:cname="TXCIF" edc:nzwidth="0x1" edc:desc="Transmit Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="RXCIF" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="nnnnnn-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xFD" edc:_addr="0x865">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
              <edc:SFRFieldDef edc:cname="RS485" edc:nzwidth="0x1" edc:desc="RS485 Mode internal transmitter">
                <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="RS485 Mode disabled" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="RS485 Mode enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ABEIE" edc:nzwidth="0x1" edc:desc="Auto-baud Error Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="LBME" edc:nzwidth="0x1" edc:desc="Loop-back Mode Enable"/>
              <edc:SFRFieldDef edc:cname="RXSIE" edc:nzwidth="0x1" edc:desc="Receiver Start Frame Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="DREIE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="TXCIE" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="RXCIE" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
